#pragma once
#include <iostream>

using namespace std;

class TPoint
{
protected:
	double x, y;		//Координаты точки

public:
	TPoint(double _x = 0, double _y = 0);
	TPoint(TPoint &point);

	void SetX(double _x);											//Задать координату X
	void SetY(double _y);											//Задать координату Y
	double GetX();														//Получить координату X
	double GetY();														//Получить координату Y

	virtual void show();											//Вывести точку на экран

	bool operator == (TPoint &point);					//Проверка на равенство
	TPoint& operator = (TPoint &point);				//Присваивание
};

//-------------------------------------------------------------------------------------------------
TPoint::TPoint(double _x, double _y)
{
	x = _x;
	y = _y;
}

//-------------------------------------------------------------------------------------------------
TPoint::TPoint(TPoint &point)
{
	x = point.x;
	y = point.y;
}


//-------------------------------------------------------------------------------------------------
void TPoint::SetX(double _x)
{
	x = _x;
}

//-------------------------------------------------------------------------------------------------
void TPoint::SetY(double _y)
{
	y = _y;
}

//-------------------------------------------------------------------------------------------------
double TPoint::GetX()
{
	return x;
}

//-------------------------------------------------------------------------------------------------
double TPoint::GetY()
{
	return y;
}

//-------------------------------------------------------------------------------------------------
void TPoint::show()
{
	cout << "(" << x << " , " << y << ")" << "\n";
}

//-------------------------------------------------------------------------------------------------
bool TPoint::operator == (TPoint &point)
{
	return ((x == point.GetX()) && (y == point.GetY()));
}

//-------------------------------------------------------------------------------------------------
TPoint& TPoint::operator = (TPoint &point)
{
	x = point.x;
	y = point.y;
	return *this;
}